<!doctype html>

<html lang="en-US">
	<head>
		<meta charset="utf-8"/>
		<link href="../styles/style.css" rel="stylesheet" />

		<title>(*voidptrfoo)(); /* [Part 1 0f 2] HackSys Extreme Vulnerable Driver Type Confusion: Reverse Engineering and Debugging */</title>
	</head>

	<body>
		<h1>[Part 1 0f 2]</br>HackSys Extreme Vulnerable Driver Type Confusion:</br>Reverse Engineering and Debugging</h1>

		<h2>1 - Introduction</h2>
		<p>
		This is the first blog post I ever publish. I hope it could have useful information for anyone interested in Windows Kernel exploitation, reverse engineering and debugging.<br/>
		I will explain all steps I took in order to exploit the Type Confusion vulnerability contained in <a href="https://github.com/hacksysteam/HackSysExtremeVulnerableDriver">HackSys Extreme Vulnerable Driver (HEVD)</a>.<br/>
		I will start on how to setup the kernel debugging lab, the reverse engineering and debugging process itself (in order to identify the vulnerability),
		and finally how to exploit the vulnerability, giving details on how to bypass mitigations like SMEP and KVA Shadowing and the shellcode creation process.<br/>
		This blog post is the first part, in which I will show the reverse engineering and debugging process. In part 2 I will show the exploit development process.
		</p>

		<h3>1.1 - For whom is this post for?</h3>
		<p>

		Substitute DEBUGGEE_MACHINE_NAME and DEBUGGEE_PIPE_NAME by the actual name you have given to your debuggee machine and the name you want to give to the named pipe, respectively. <a href="https://learn.microsoft.com/en-us/powershell/module/hyper-v/set-vmcomport?view=windowsserver2022-ps">Learn more about Set-VmComPort</a>.<br/>
		Next, in the debuggee machine, open a privileged Command Prompt and type the following:
		<pre><code class="code-snippet">bcdedit /debug on</code></pre>
		<pre><code class="code-snippet">bcdedit /dbgsettings serial debugport:1 baudrate:115200</code></pre>
		In the debugger machine, run WinDbg (X64) as administrator. When it finishes open, press Ctrl+K in order to open the kernel debugging options window.
		When the Kernel Debugging window opens, select the COM tab and change the Port field with \\.\pipe\DEBUGGEE_PIPE_NAME. Do not forget to change DEBUGGEE_PIPE_NAME by the actual name you given to the newly created named pipe.
		Then, check the boxes Pipe and Reconnect and press the OK button.<br/>
		Finally, it is only needed to reboot the debuggee machine and, if all the steps were followed and successfully executed, a debugging session will start in the WinDbg (X64) instance in the debugger machine.
		</p>

		<h2>3 - Reversing and Debugging: the vulnerability discovery process</h2>
		<p>
		Before we are able to exploit the vulnerability, we first need to spot it. In order to do so, we will be doing as if we do not have acess to the driver's source code.<br/>
		A disclaimer I would like to give before we proceed is: as API functions are presented alongside with the documentation, it is vital that the specification to be studied. This is due to: 1) have a real understanding of what is real happening and; 2) I want you to get used to reading the documentation when needed.
		I would not be doing a good job in explaining argument by argument if I want to take in consideration your learning process. This way, reading the documentation and have a real understanding of the API functions is definitive for your success while learning from this blog post.
		</p>

		<h3>3.1 - Windows Drivers and IOCTLs</h3>
		<p>
		A common attack surface, and the one we will be studying here, when we talk about device drivers in general, are the <a href="https://learn.microsoft.com/en-us/windows-hardware/drivers/kernel/introduction-to-i-o-control-codes">IOCTLs</a>. There are others attack vectors, but this information is given as a disclaimer and for completeness.<br/>
		In order to identify possible IOCTLs codes, which are necessary in order to identify possible code paths that are vulnerable, we first need to learn about one important Windows defined structure: <a href="https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/wdm/ns-wdm-_driver_object">_DRIVER_OBJECT</a>.<br/>
		To better understand this structure for our purposes, we will first pause the debuggee machine in the debugger and, then, we will use the dt command in WinDbg to display the _DRIVER_OBJECT structure:
		<pre><code class="code-snippet">kd&gt; dt _DRIVER_OBJECT
ntdll!_DRIVER_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x008 DeviceObject     : Ptr64 _DEVICE_OBJECT
   +0x010 Flags            : Uint4B
   +0x018 DriverStart      : Ptr64 Void
   +0x020 DriverSize       : Uint4B
   +0x028 DriverSection    : Ptr64 Void
   +0x030 DriverExtension  : Ptr64 _DRIVER_EXTENSION
   +0x038 DriverName       : _UNICODE_STRING
   +0x048 HardwareDatabase : Ptr64 _UNICODE_STRING
   +0x050 FastIoDispatch   : Ptr64 _FAST_IO_DISPATCH
   +0x058 DriverInit       : Ptr64     long 
   +0x060 DriverStartIo    : Ptr64     void 
   +0x068 DriverUnload     : Ptr64     void 
   +0x070 MajorFunction    : [28] Ptr64     long 
</code></pre>
		The field that most matters to us is the <a href="https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/wdm/ns-wdm-_driver_object#members">MajorFunction</a> element, at offset +0x070, which is a dispatch table.<br/>
		What is interesting about this field is that when the <a href="https://learn.microsoft.com/en-us/windows-hardware/drivers/wdf/driverentry-for-kmdf-drivers">DriverEntry routine</a> gets executed it populates an object of _DRIVER_OBJECT type, and the MajorFunction elements will contain the function that will handle the IOCTLs for the driver.<br/>
		This way, the approach used here is the one of identify the DriverEntry routine in the driver and, once we get there, identify the function that will handle the IOCTLs by observing the _DRIVER_OBJECT object being populated. Having done that we could place a breakpoint in it and start the vulnerability hunting.<br/>
